In [1]:
import findspark
findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder.getOrCreate()

In [2]:
#reading incentives csv file
incentives = spark.read.option("header",True).csv("C:/Papu/Inmar/Exercise 2/incentives.csv")

In [3]:
#displaying few rows in incentives dataframe
incentives.show()

+------------+--------+-----------+-----------+
|INCENTIVE_ID|CLIENTID|ACTIVE_DATE|EXPIRE_DATE|
+------------+--------+-----------+-----------+
|      251815|     186|  11/1/2017| 12/14/2017|
|      252231|     186|  12/1/2017| 12/31/2017|
|      292723|     186|  11/1/2017| 12/14/2017|
|      308996|     186|   6/1/2017| 12/31/2017|
|      309945|     186|   6/1/2017| 12/31/2017|
|      310053|     186|   6/1/2017| 12/31/2017|
|      310532|     186|   6/1/2017| 12/31/2017|
|      319840|     186|  8/31/2017| 12/14/2017|
|      324257|     186|  10/2/2017|  12/2/2017|
|      342678|     186| 10/15/2017| 12/14/2017|
|      342694|     186|  8/27/2017|  12/1/2017|
|      343012|     186| 11/10/2017| 12/31/2017|
|      343147|     186| 10/15/2017| 12/14/2017|
|      343162|     186| 10/15/2017| 12/14/2017|
|      345089|     186|  11/1/2017| 12/30/2017|
|      352136|     186| 10/29/2017| 12/26/2017|
|      352494|     186|  11/1/2017|  12/2/2017|
|      352523|     186|  10/1/2017| 12/30/2017|
|      352548|     186|  11/1/2017|  12/2/2017|
|      352668|     186|  10/8/2017| 12/31/2017|
+------------+--------+-----------+-----------+
only showing top 20 rows

In [4]:
#reading incentive_upc csv file into dataframe
incentive_upc = spark.read.option("header",True).csv("C:/Papu/Inmar/Exercise 2/incentive_upc.csv")

In [5]:
#uisng sql function from pyspark
from pyspark.sql.functions import *

In [6]:
#resultant dataframe shows join of incentives and incentive_upc data frames
df = incentives.join(incentive_upc,incentives.INCENTIVE_ID == incentive_upc.INCENTIVE_ID)

In [7]:
df.show()

+------------+--------+-----------+-----------+------------+----------+
|INCENTIVE_ID|CLIENTID|ACTIVE_DATE|EXPIRE_DATE|INCENTIVE_ID|  UPC_CODE|
+------------+--------+-----------+-----------+------------+----------+
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600010517|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600010518|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600011954|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600011956|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600011957|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600011958|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600011959|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600011960|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600025809|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600025810|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600029161|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600029162|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600030517|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600030518|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600030519|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600030521|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600030525|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600030526|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600030527|
|      251815|     186|  11/1/2017| 12/14/2017|      251815|3600030528|
+------------+--------+-----------+-----------+------------+----------+
only showing top 20 rows

In [8]:
import pandas as pd

In [9]:
transaction_items = pd.read_csv("https://s3.amazonaws.com/inmar-interview-dataanalyst/Rawdata/Transaction_item.txt")

In [10]:
transaction_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 516569 entries, 0 to 516568
Data columns (total 1 columns):
CLIENTID|DATE|BASKET_ID|PRODUCT_ID|QUANTITY    516569 non-null object
dtypes: object(1)
memory usage: 3.9+ MB

In [11]:
transaction_items['CLIENTID'], transaction_items['DATE'], transaction_items['BASKET_ID'], transaction_items['PRODUCT_ID'], transaction_items['QUANTITY']=\
transaction_items['CLIENTID|DATE|BASKET_ID|PRODUCT_ID|QUANTITY'].str.split('|').str

In [12]:
type(transaction_items)

pandas.core.frame.DataFrame

In [13]:
transaction_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 516569 entries, 0 to 516568
Data columns (total 6 columns):
CLIENTID|DATE|BASKET_ID|PRODUCT_ID|QUANTITY    516569 non-null object
CLIENTID                                       516569 non-null object
DATE                                           516569 non-null object
BASKET_ID                                      516569 non-null object
PRODUCT_ID                                     516569 non-null object
QUANTITY                                       516569 non-null object
dtypes: object(6)
memory usage: 23.6+ MB

In [14]:
transaction_items.drop(['CLIENTID|DATE|BASKET_ID|PRODUCT_ID|QUANTITY'], axis=1,inplace=True)
transaction_items.head()

  CLIENTID        DATE           BASKET_ID   PRODUCT_ID QUANTITY
0      186  2016-12-11  201612000202185545   2840003400        1
1      186  2016-12-11  201612000202185545   7210006600        1
2      186  2016-12-11  201612000202185545  60069900154        1
3      186  2016-12-11  201612000202185545   3935900103        2
4      186  2016-12-11  201612000202185545   2100005773        2

In [15]:
transaction_items1 = pd.read_csv("https://s3.amazonaws.com/inmar-interview-dataanalyst/Rawdata/Transaction_items1.txt")

In [16]:
transaction_items1['CLIENTID'], transaction_items1['DATE'], transaction_items1['BASKET_ID'], transaction_items1['PRODUCT_ID'], transaction_items1['QUANTITY']=\
transaction_items1['CLIENTID|DATE|BASKET_ID|PRODUCT_ID|QUANTITY'].str.split('|').str

In [17]:
transaction_items1.drop(['CLIENTID|DATE|BASKET_ID|PRODUCT_ID|QUANTITY'], axis=1,inplace=True)
transaction_items1.head()

  CLIENTID        DATE           BASKET_ID  PRODUCT_ID QUANTITY
0      186  2018-07-06  201807000057579467  3700030757        1
1      186  2018-07-06  201807000057579467      443699        1
2      186  2018-07-11  201807000116894357  3700096260        1
3      186  2018-07-11  201807000116894357      443727        1
4      186  2018-07-15  201807000189782840  4132235655        1

In [18]:
ti = pd.concat([transaction_items,transaction_items1])

In [19]:
len(transaction_items)

516569

In [20]:
len(transaction_items1)

1322892

In [21]:
len(ti)

1839461

In [22]:
transactionitems = spark.createDataFrame(ti)

In [23]:
transactionitems.printSchema()

root
 |-- CLIENTID: string (nullable = true)
 |-- DATE: string (nullable = true)
 |-- BASKET_ID: string (nullable = true)
 |-- PRODUCT_ID: string (nullable = true)
 |-- QUANTITY: string (nullable = true)

In [24]:
transactions_pd = pd.read_csv("https://s3.amazonaws.com/inmar-interview-dataanalyst/Rawdata/Transactions.txt")

In [25]:
type(transactionitems)

pyspark.sql.dataframe.DataFrame

In [26]:
transactions_pd.head()

     CLIENTID|DATE|BASKET_ID|CONSUMER_ID_ID
0   186|2018-07-11|201807000115668487|15124
1  186|2018-07-09|201807000100675726|204102
2   186|2018-07-08|201807000083647501|13188
3   186|2018-07-21|201807000276629716|80397
4  186|2018-07-09|201807000102930137|205496

In [27]:
transactions_pd['CLIENTID'], transactions_pd['DATE'], transactions_pd['BASKET_ID'], transactions_pd['CONSUMER_ID_ID']=\
transactions_pd['CLIENTID|DATE|BASKET_ID|CONSUMER_ID_ID'].str.split('|').str

In [28]:
transactions_pd.head()

,CLIENTID|DATE|BASKET_ID|CONSUMER_ID_ID,CLIENTID,DATE,BASKET_ID,CONSUMER_ID_ID
0,186|2018-07-11|201807000115668487|15124,186,2018-07-11,201807000115668487,15124
1,186|2018-07-09|201807000100675726|204102,186,2018-07-09,201807000100675726,204102
2,186|2018-07-08|201807000083647501|13188,186,2018-07-08,201807000083647501,13188
3,186|2018-07-21|201807000276629716|80397,186,2018-07-21,201807000276629716,80397
4,186|2018-07-09|201807000102930137|205496,186,2018-07-09,201807000102930137,205496

In [29]:
transactions_pd.drop(['CLIENTID|DATE|BASKET_ID|CONSUMER_ID_ID'], axis=1,inplace=True)
transactions_pd.head()

  CLIENTID        DATE           BASKET_ID CONSUMER_ID_ID
0      186  2018-07-11  201807000115668487          15124
1      186  2018-07-09  201807000100675726         204102
2      186  2018-07-08  201807000083647501          13188
3      186  2018-07-21  201807000276629716          80397
4      186  2018-07-09  201807000102930137         205496

In [30]:
transactions = spark.createDataFrame(transactions_pd)

In [31]:
transactions.printSchema()

root
 |-- CLIENTID: string (nullable = true)
 |-- DATE: string (nullable = true)
 |-- BASKET_ID: string (nullable = true)
 |-- CONSUMER_ID_ID: string (nullable = true)

In [32]:
incentives.show()

+------------+--------+-----------+-----------+
|INCENTIVE_ID|CLIENTID|ACTIVE_DATE|EXPIRE_DATE|
+------------+--------+-----------+-----------+
|      251815|     186|  11/1/2017| 12/14/2017|
|      252231|     186|  12/1/2017| 12/31/2017|
|      292723|     186|  11/1/2017| 12/14/2017|
|      308996|     186|   6/1/2017| 12/31/2017|
|      309945|     186|   6/1/2017| 12/31/2017|
|      310053|     186|   6/1/2017| 12/31/2017|
|      310532|     186|   6/1/2017| 12/31/2017|
|      319840|     186|  8/31/2017| 12/14/2017|
|      324257|     186|  10/2/2017|  12/2/2017|
|      342678|     186| 10/15/2017| 12/14/2017|
|      342694|     186|  8/27/2017|  12/1/2017|
|      343012|     186| 11/10/2017| 12/31/2017|
|      343147|     186| 10/15/2017| 12/14/2017|
|      343162|     186| 10/15/2017| 12/14/2017|
|      345089|     186|  11/1/2017| 12/30/2017|
|      352136|     186| 10/29/2017| 12/26/2017|
|      352494|     186|  11/1/2017|  12/2/2017|
|      352523|     186|  10/1/2017| 12/30/2017|
|      352548|     186|  11/1/2017|  12/2/2017|
|      352668|     186|  10/8/2017| 12/31/2017|
+------------+--------+-----------+-----------+
only showing top 20 rows

In [33]:
incentive_upc.show()

+------------+----------+
|INCENTIVE_ID|  UPC_CODE|
+------------+----------+
|      251815|3600010517|
|      251815|3600010518|
|      251815|3600011954|
|      251815|3600011956|
|      251815|3600011957|
|      251815|3600011958|
|      251815|3600011959|
|      251815|3600011960|
|      251815|3600025809|
|      251815|3600025810|
|      251815|3600029161|
|      251815|3600029162|
|      251815|3600030517|
|      251815|3600030518|
|      251815|3600030519|
|      251815|3600030521|
|      251815|3600030525|
|      251815|3600030526|
|      251815|3600030527|
|      251815|3600030528|
+------------+----------+
only showing top 20 rows

In [34]:
transactions.show()

+--------+----------+------------------+--------------+
|CLIENTID|      DATE|         BASKET_ID|CONSUMER_ID_ID|
+--------+----------+------------------+--------------+
|     186|2018-07-11|201807000115668487|         15124|
|     186|2018-07-09|201807000100675726|        204102|
|     186|2018-07-08|201807000083647501|         13188|
|     186|2018-07-21|201807000276629716|         80397|
|     186|2018-07-09|201807000102930137|        205496|
|     186|2018-07-21|201807000262403808|          1629|
|     186|2018-07-25|201807000319479637|          8374|
|     186|2018-07-05|201807000040168223|          1072|
|     186|2018-07-13|201807000186686321|          1956|
|     186|2018-07-11|201807000117017750|         36889|
|     186|2018-07-13|201807000166458216|         12787|
|     186|2018-07-10|201807000106075626|        196733|
|     186|2018-07-06|201807000048973596|        164999|
|     186|2018-07-13|201807000191884193|          7765|
|     186|2018-07-05|201807000040276322|         93998|
|     186|2018-07-10|201807000112472044|        208208|
|     186|2018-07-13|201807000175774286|         45876|
|     186|2018-07-02|201807000014551194|         11968|
|     186|2018-07-14|201807000183941109|        203541|
|     186|2018-07-14|201807000170289623|         26447|
+--------+----------+------------------+--------------+
only showing top 20 rows

In [35]:
transactionitems.show()

+--------+----------+------------------+-----------+--------+
|CLIENTID|      DATE|         BASKET_ID| PRODUCT_ID|QUANTITY|
+--------+----------+------------------+-----------+--------+
|     186|2016-12-11|201612000202185545| 2840003400|       1|
|     186|2016-12-11|201612000202185545| 7210006600|       1|
|     186|2016-12-11|201612000202185545|60069900154|       1|
|     186|2016-12-11|201612000202185545| 3935900103|       2|
|     186|2016-12-11|201612000202185545| 2100005773|       2|
|     186|2016-12-11|201612000202185545| 4300000953|       4|
|     186|2016-12-11|201612000202185545| 3400005200|       1|
|     186|2016-12-11|201612000202185545| 5070000003|       2|
|     186|2016-12-11|201612000202185545|81547301041|       2|
|     186|2016-12-11|201612000202185545| 3760010506|       1|
|     186|2016-12-11|201612000202185545| 4850001833|       1|
|     186|2016-12-11|201612000202185545| 5070056670|       1|
|     186|2016-12-11|201612000202185545| 5070024415|       1|
|     186|2016-12-11|201612000202185545|81547301037|       1|
|     186|2016-12-11|201612000202185545| 5000001051|       1|
|     186|2016-12-11|201612000202185545|65272910113|       1|
|     186|2016-12-11|201612000202185545|74816291547|       2|
|     186|2016-12-11|201612000202185545| 2100002820|       2|
|     186|2016-12-11|201612000202185545| 3770032217|       8|
|     186|2016-12-11|201612000202185545| 2100005774|       2|
+--------+----------+------------------+-----------+--------+
only showing top 20 rows

In [36]:
## table - dataframes
# incentives - incentives
# incentive_upc - incentive_upc
# transactions - transactions
# transactionitems (combined both tables into 1) - transactionitems

In [37]:
display(incentives)

DataFrame[INCENTIVE_ID: string, CLIENTID: string, ACTIVE_DATE: string, EXPIRE_DATE: string]

In [38]:
from pyspark.sql import SQLContext
sqlContext = SQLContext(spark)

In [39]:
#registering the dataframes as temporary tables for querying the data
incentives.registerTempTable('incentives_table')
incentive_upc.registerTempTable('incentive_upc_table')
transactions.registerTempTable('transactions_table')
transactionitems.registerTempTable('transactionitems_table')

In [40]:
sqlContext.sql(""" select * from incentives_table as inc""").show(10)

+------------+--------+-----------+-----------+
|INCENTIVE_ID|CLIENTID|ACTIVE_DATE|EXPIRE_DATE|
+------------+--------+-----------+-----------+
|      251815|     186|  11/1/2017| 12/14/2017|
|      252231|     186|  12/1/2017| 12/31/2017|
|      292723|     186|  11/1/2017| 12/14/2017|
|      308996|     186|   6/1/2017| 12/31/2017|
|      309945|     186|   6/1/2017| 12/31/2017|
|      310053|     186|   6/1/2017| 12/31/2017|
|      310532|     186|   6/1/2017| 12/31/2017|
|      319840|     186|  8/31/2017| 12/14/2017|
|      324257|     186|  10/2/2017|  12/2/2017|
|      342678|     186| 10/15/2017| 12/14/2017|
+------------+--------+-----------+-----------+
only showing top 10 rows

In [41]:
sqlContext.sql(""" select * from incentive_upc_table as inc_upc""").show(10)

+------------+----------+
|INCENTIVE_ID|  UPC_CODE|
+------------+----------+
|      251815|3600010517|
|      251815|3600010518|
|      251815|3600011954|
|      251815|3600011956|
|      251815|3600011957|
|      251815|3600011958|
|      251815|3600011959|
|      251815|3600011960|
|      251815|3600025809|
|      251815|3600025810|
+------------+----------+
only showing top 10 rows

In [42]:
sqlContext.sql(""" select * from transactions_table as trans""").show(10)

+--------+----------+------------------+--------------+
|CLIENTID|      DATE|         BASKET_ID|CONSUMER_ID_ID|
+--------+----------+------------------+--------------+
|     186|2018-07-11|201807000115668487|         15124|
|     186|2018-07-09|201807000100675726|        204102|
|     186|2018-07-08|201807000083647501|         13188|
|     186|2018-07-21|201807000276629716|         80397|
|     186|2018-07-09|201807000102930137|        205496|
|     186|2018-07-21|201807000262403808|          1629|
|     186|2018-07-25|201807000319479637|          8374|
|     186|2018-07-05|201807000040168223|          1072|
|     186|2018-07-13|201807000186686321|          1956|
|     186|2018-07-11|201807000117017750|         36889|
+--------+----------+------------------+--------------+
only showing top 10 rows

In [45]:
sqlContext.sql(""" select * from incentive_upc_table inc_upc \
                   inner join incentives_table inc on inc_upc.INCENTIVE_ID = inc.INCENTIVE_ID \
                   inner join transactions_table trans on inc.CLIENTID = trans.CLIENTID""").show(10)

+------------+----------+------------+--------+-----------+-----------+--------+----------+------------------+--------------+
|INCENTIVE_ID|  UPC_CODE|INCENTIVE_ID|CLIENTID|ACTIVE_DATE|EXPIRE_DATE|CLIENTID|      DATE|         BASKET_ID|CONSUMER_ID_ID|
+------------+----------+------------+--------+-----------+-----------+--------+----------+------------------+--------------+
|      251815|3600010517|      251815|     186|  11/1/2017| 12/14/2017|     186|2018-07-11|201807000115668487|         15124|
|      251815|3600010517|      251815|     186|  11/1/2017| 12/14/2017|     186|2018-07-09|201807000100675726|        204102|
|      251815|3600010517|      251815|     186|  11/1/2017| 12/14/2017|     186|2018-07-08|201807000083647501|         13188|
|      251815|3600010517|      251815|     186|  11/1/2017| 12/14/2017|     186|2018-07-21|201807000276629716|         80397|
|      251815|3600010517|      251815|     186|  11/1/2017| 12/14/2017|     186|2018-07-09|201807000102930137|        205496|
|      251815|3600010517|      251815|     186|  11/1/2017| 12/14/2017|     186|2018-07-21|201807000262403808|          1629|
|      251815|3600010517|      251815|     186|  11/1/2017| 12/14/2017|     186|2018-07-25|201807000319479637|          8374|
|      251815|3600010517|      251815|     186|  11/1/2017| 12/14/2017|     186|2018-07-05|201807000040168223|          1072|
|      251815|3600010517|      251815|     186|  11/1/2017| 12/14/2017|     186|2018-07-13|201807000186686321|          1956|
|      251815|3600010517|      251815|     186|  11/1/2017| 12/14/2017|     186|2018-07-11|201807000117017750|         36889|
+------------+----------+------------+--------+-----------+-----------+--------+----------+------------------+--------------+
only showing top 10 rows

In [ ]:
sqlContext.sql(""" select inc_upc.UPC_CODE, inc_upc.INCENTIVE_ID, inc.ACTIVE_DATE, inc.EXPIRE_DATE, trans.CLIENTID,\
                   trans.BASKET_ID, trans.CONSUMER_ID_ID, trans.DATE \
                   from incentive_upc_table inc_upc \
                   inner join incentives_table inc on inc_upc.INCENTIVE_ID = inc.INCENTIVE_ID \
                   inner join transactions_table trans on inc.CLIENTID = trans.CLIENTID \
                   inner join transactionitems_table transitems on trans.CLIENTID = transitems.CLIENTID  and trans.BASKET_ID = transitems.BASKET_ID and trans.DATE = transitems.DATE""").show(10)